Repository: Gleb-Kovalenko/GDEBankProject
Catalog: GDEBankCore/Resources/Localization/*.lproj/GDEBankCoreLocalizable.strings
Languages: ru

# general.confirm
source: Confirm
ru: Подтвердить

# general.error
source: Error
ru: Ошибка

# general.or
source: Or
ru: Или

# general.cancel
source: Cancel
ru: Отменить

# general.settings
source: Settings
ru: Настройки

# general.cannot-obtain-file
source: Can't dowload file
ru: Не удалось загрузить файл

# general.required-memo-message
source: We cannot create a translation without a memo. If you are sure that you do not need to specify it for translation, then you can enter any text in the memo field
ru: Мы не можем создать перевод без memo. Если вы уверены, что для перевода не нужно его указывать, то можете вписать в поле memo любой текст

source: Download
ru: Скачать

source: Apply
ru: Применить

source: Balance
ru: Баланс

source: Done
ru: Готово

# auth.login.navigation-title
source: Log in to your account
ru: Вход в личный кабинет

# auth.registration.navigation-title
source: Registration
ru: Регистрация

# auth.first-time-in-app.title
source: First time in GDEBank?
ru: Впервые в GDEBank?

# auth.sign-up.title
source: Sign up
ru: Зарегистрироваться

# errors.email.incorrect-email
source: Incorrect Email
ru: Ошибка ввода Email

# errors.email.incorrect-email-or-password
source: Incorrect Email or password
ru: Ошибка пароля или Email

# errors.phone.incorrect-phone
source: The number was entered incorrectly
ru: Номер введен некорреткно

# errors.phone.incorrect-phone-or-password
source: Incorrect phone number or password
ru: Ошибка пароля или номера телефона

# errors.account-statement.no-statement
source: Couldn't get a link to the report
ru: Не удалось получить ссылку на отчет

# errors.no-qr-code-link
source: Couldn't get a qr code link
ru: Не удалось получить ссылку на qr код

# errors.parse-error
source: Can't get data
ru: Не удалось получить данные

# errors.general
source: Something went wrong
ru: Что-то пошло не так

# log-in.phone
source: Phone
ru: Телефон

# log-in.email
source: Email
ru: Электронная почта

# log-in.sign-in-button-title
source: Sign in
ru: Войти

# email-entering.login.email-name
source: Email
ru: Электронная почта

# email-entering.login.password-name
source: Password
ru: Пароль

# email-entering.login.forgot-password
source: Forgot password?
ru: Забыли пароль?

# email-entering.login.sign-in
source: Sign in
ru: Войти

# email-entering.registration.next
source: Next
ru: Далее

# email-entering.registration.enter-email
source: Enter Email
ru: Введите Email

# email-entering.registration.already-registered
source: Already registered?
ru: Уже зарегестрированы?

# email-entering.registration.sign-in
source: Sign in
ru: Войти

# email-entering.registration.support-center
source: Support center
ru: Центр поддержки

# email-entering.email-changing.title
source: Enter a new email address
ru: Введите новый адрес электронной почты

# email-entering.email-changing.subtitle
source: We will send a confirmation code to this address
ru: Мы вышлем код подтверждения на этот адрес

# email-entering.email-changing.next
source: Next
ru: Далее

# email-entering.password-restore.title
source: Forgot your password?
ru: Забыли пароль?

# email-entering.password-restore.subtitle
source: Enter your email address and we will send you instructions for password recovery
ru: Введите электронную почту и мы отправим на нее инструкцию для восстановления пароля

# email-entering.password-restore.email-name
source: Email
ru: Электронная почта

# email-entering.password-restore.no-access
source: I don't have access to mail
ru: У меня нет доступа к почте

# email-entering.password-restore.return-to-login
source: Go back to the login screen
ru: Вернуться к экрану входа

# email-entering.password-restore.send
source: Send
ru: Отправить

# email-entering.password-restore.support-center
source: Support center
ru: Центр поддержки

# phone-entering.login.email-name
source: Phone
ru: Телефон

# phone-entering.login.password-name
source: Password
ru: Пароль

# phone-entering.login.forgot-password
source: Forgot password?
ru: Забыли пароль?

# phone-entering.login.sign-in
source: Sign in
ru: Войти

# phone-entering.registration.next
source: Send code
ru: Отправить код

# phone-entering.registration.title
source: Enter your phone number
ru: Введите номер телефона

# phone-entering.registration.description
source: We will send a confirmation code to this number
ru: Мы вышлем код подтверждения на этот номер

# phone-entering.registration.already-registered
source: Already registered?
ru: Уже зарегестрированы?

# phone-entering.registration.sign-in
source: Sign in
ru: Войти

# phone-entering.registration.support-center
source: Support Center
ru: Центр поддержки

# phone-entering.phone-changing.title
source: Enter a new phone number
ru: Введите новый номер телефона

# phone-entering.phone-changing.subtitle
source: We will send an SMS with a confirmation code to this number
ru: Мы вышлем SMS с кодом подтверждения на этот номер

# phone-entering.password-restore.title
source: Forgot your password?
ru: Забыли пароль?

# phone-entering.password-restore.subtitle
source: Enter your phone number and we will send you an SMS with instructions for password recovery
ru: Введите номер телефона и мы отправим СМС с инструкцией для восстановления пароля

# phone-entering.password-restore.phone-name
source: Phone number
ru: Номер телефона

# phone-entering.password-restore.no-access
source: I don't have access to my phone
ru: У меня нет доступа к телефону

# phone-entering.password-restore.return-to-login
source: Go back to the login screen
ru: Вернуться к экрану входа

# phone-entering.password-restore.send
source: Send
ru: Отправить

# phone-entering.password-restore.support-button-title
source: Support Center
ru: Центр поддержки

# phone-entering.external-sign-in.title
source: Enter your phone number
ru: Введите ваш номер телефона

# phone-entering.external-sign-in.subtitle
source: We will send an SMS with a confirmation code to this number
ru: Мы вышлем SMS с кодом подтверждения на этот номер

# phone-entering.external-sign-in.send
source: Next
ru: Продолжить

# code-confirmation.resend-button.title
source: Get the code again through
ru: Получить код повторно через

# code-confirmation.change-phone.title
source: Change phone number
ru: Изменить телефон

# code-confirmation.support-button.title
source: Support Center
ru: Центр поддержки

# code-confirmation.no-receive-code-button.title
source: I didn't get the code
ru: Я не получил(а) код

# code-confirmation.resend-code.title
source: Get code again
ru: Получить код повторно

# code-confirmation.check-code.error-title
source: Code entered incorrectly
ru: Код введен некорректно

# code-confirmation.send-code.error-title
source: Failed to send code
ru: Не удалось отправить код

# external-sign-in.navigation-title
source: Apple / Google sign in
ru: Вход через Apple / Google

# password-entering.create-password.title
source: Enter your password
ru: Введите свой пароль

# password-entering.create-password.repeat
source: Repeat
ru: Повторите

# password-entering.create-password.requirement-description
source: The password must contain at least 6 letters, including a capital letter, a symbol and a number
ru: Пароль должен содержать не менее 6 букв, включая заглавную, символ и цифру

# password-entering.create-password.action-button-title
source: Register
ru: Зарегистрироваться

# password-entering.create-password.support-center
source: Support Center
ru: Центр поддержки

# password-entering.restore-password.title
source: Enter new password
ru: Введите новый пароль

# password-entering.restore-password.repeat
source: Repeat
ru: Повторите

# password-entering.restore-password.requirement-description
source: The password must contain at least 6 letters, including a capital letter, a symbol and a number
ru: Пароль должен содержать не менее 6 букв, включая заглавную, символ и цифру

# password-entering.restore-password.action-button-title
source: Sign in
ru: Войти

# password-entering.restore-password.support-center
source: Support Center
ru: Центр поддержки

# password-entering.passwords-not-equal
source: Passwords don't match
ru: Пароли не совпадают

# password-entering.passwords-not-match-requirements
source: The password doesn't match the requirements
ru: Пароль не соответствует требованиям

# change-password.navigation-title
source: Change password
ru: Изменить пароль

# change-password.old-password-title
source: Old password
ru: Старый пароль

# change-password.new-password-title
source: New password
ru: Новый пароль

# change-password.confirm-password-title
source: Confirm new password
ru: Повторите новый пароль

# change-password.change-password-button-text
source: Change password
ru: Изменить пароль

# card.block-message
source: The card is blocked! To unlock, contact the support center
ru: Карта заблокирована! Для разблокировки обратитесь в центр поддержки

# code-confirmation.phone-registration.title
source: Enter the code from the SMS
ru: Введите код из SMS

# code-confirmation.email-registration.title
source: Confirm your Email
ru: Подтвердите ваш Email

# code-confirmation.email-registration.subtitle
source: We have sent an email to your Email address. Click on the link in the email to confirm the Email.
ru: Мы отправили письмо на ваш Email. Перейдите по ссылке в письме, чтобы подтвердить Email.

# code-confirmation.restore-password.email.title
source: We have sent you an email
ru: Мы отправили вам письмо

# code-confirmation.restore-password.email.subtitle
source: To log in, enter the code sent to your email
ru: Для входа введите код, отправленный на электронную почту

# code-confirmation.restore-password.phone.title
source: We have sent you an SMS
ru: Мы отправили вам СМС

# code-confirmation.restore-password.phone.subtitle
source: To log in, enter the code sent to your phone
ru: Для входа введите код, отправленный на ваш телефонный номер

# code-confirmation.another-device.title
source: We noticed the input from another device
ru: Мы заметили вход с другого устройства

# code-confirmation.another-device.subtitle
source: For security, enter the code that was sent to the mail
ru: Для безопасности введите код, который отправлен на почту

# code-confirmation.change-phone.old-number.subtitle
source: To change the phone number, enter the code that we sent to the number %@
ru: Для изменения номера телефона введите код, который мы отправили на номер %@

# code-confirmation.change-phone.new-number.title
source: Enter the code
ru: Введите код

# code-confirmation.change-email.old-email.subtitle
source: To change the email address, enter the code that we sent to the address %@
ru: Для изменения электронной почты введите код, который мы отправили на адрес %@

# code-confirmation.change-email.new-email.title
source: Enter the code
ru: Введите код

# code-confirmation.change-email.navigation-title
source: Change email
ru: Изменение электронной почты

# code-confirmation.change-phone.navigation-title
source: Change phone Number
ru: Изменение номера телефона

# currency.usd.wallet-description
source: Dollar
ru: Долларовый

# currency.eur.wallet-description
source: Euro
ru: Евровый

# currency.gbp.wallet-description
source: Pound
ru: Фунтовый

# currency.aed.wallet-description
source: Dirhams
ru: Дирхам

# currency.try.wallet-description
source: Lira
ru: Лира

# currency.gel.wallet-description
source: Lari
ru: Лари

# currency.usd.account-title
source: Dollar USD
ru: Доллар USD

# currency.eur.account-title
source: Euro EUR
ru: Евро EUR

# currency.gbp.account-title
source: Pound GBR
ru: Фунт GBR

# currency.aed.account-title
source: Dirhams AED
ru: Дирхам AED

# currency.try.account-title
source: Lira TRY
ru: Лира TRY

# currency.gel.account-title
source: Lari GEL
ru: Лари GEL

# currency.usd.localizedName
source: Dollar
ru: Доллар

# currency.eur.localizedName
source: Euro
ru: Евро

# currency.gbp.localizedName
source: Pound
ru: Фунт

# currency.aed.localizedName
source: Dirham
ru: Дирхам

# currency.try.localizedName
source: Lira
ru: Лира

# currency.gel.localizedName
source: Lari
ru: Лари

# currency.usdt.localizedName
source: Tether
ru: Тезер

# currency.trx.localizedName
source: TRON
ru: ТРОН

# currency.ton.localizedName
source: Toncoin
ru: Тонкоин

# currency.eth.localizedName
source: TRX
ru: Эфириум

# currency.btc.localizedName
source: Bitcoin
ru: Биткоин

# currency.group.fiat.title
source: Fiat accounts
ru: Фиатные счета

# currency.group.crypto.title
source: Crypto accounts
ru: Крипто счета

# passcode-flow.verification.navigation-title
source: Passcode for entry
ru: Код для входа

# passcode-flow.changing.navigation-title
source: Change passcode
ru: Смена код-пароля

# passcode-lock.face-and-touch-id-title
source: Would you like to enable Touch ID or Face ID for entry?
ru: Хотите включить Touch ID или Face ID для входа?

# passcode-lock.later-button-title
source: Later
ru: Позже

# passcode-lock.setup-passcode
source: Set passcode
ru: Установите код-пароль

# passcode-lock.repeat-passcode
source: Repeat passcode
ru: Повторите код

# passcode-lock.enter-old-passcode
source: Enter old passcode
ru: Введите старый код-пароль

# passcode-lock.repeat-new-passcode
source: Repeat new passcode
ru: Повторите новый код-пароль

# passcode-lock.come-up-passcode
source: Create a passcode
ru: Придумайте код

# passcode-lock.enter-passcode
source: Enter passcode
ru: Введите код-пароль

# passcode-lock.biometric-evaluation-reason
source: To skip entering the passcode every time
ru: Чтобы каждый раз не вводить код-пароль

# NSFaceIDUsageDescription
source: To skip entering the passcode every time
ru: Чтобы каждый раз не вводить код-пароль

# device-detail.title
source: Details
ru: Детали

# device-detail.info
source: Connect the device and log in without SMS confirmation
ru: Подключить устройство и входить без SMS подтверждения

# device-detail.characteristic.device-name
source: Name
ru: Название

# device-detail.characteristic.device-OS
source: Operating system
ru: Операционная система

# device-detail.characteristic.connection-date
source: Connected
ru: Подключено

# device-detail.delete-button-title
source: Remove device
ru: Удалить устройство

# verification-success.phone.title
source: Your phone number has been changed
ru: Ваш номер телефона изменен

# verification-success.email.title
source: Your email address has been changed
ru: Ваш адрес электронной почты изменен

# verification-success.button-title
source: To the main page
ru: На главную

# external-auth.apple.button-title
source: Continue with Apple
ru: Продолжить с Apple

# external-auth.google.button-title
source: Continue with Google
ru: Продолжить с Google

# device-list.navigation-title
source: Devices
ru: Устройства

# device-list.title
source: Your devices
ru: Ваши устройства

# device-list.subtitle
source: Mark these devices as connected so you can sign in to the app without SMS or verification code
ru: Отметьте эти устройства как подключенные, тогда вы сможете входить в приложение без SMS или кода подтверждения

# device-list.list-title
source: Connected devices
ru: Подключенные устройства

# device-list.item.subtitle
source: Connection date
ru: Дата подключения

# sum-sub.error-message
source: Something went wrong. Please try again
ru: Что-то пошло не так. Попробуйте еще раз

# transaction.status.new.name
source: New
ru: Новый

# transaction.status.success.name
source: Success
ru: Успешно

# transaction.status.pending.name
source: Pending
ru: Ожидает

# transaction.status.error.name
source: Error
ru: Ошибка

# transaction-type.exchange.name
source: Exchange
ru: Конвертация

# transaction-type.transfer.name
source: Transfer
ru: Перевод

# transaction-type.payment.name
source: Payment
ru: Оплата

# transaction-type.deposit.name
source: Deposit
ru: Депозит

# transaction-type.fee.name
source: Fee
ru: Комиссия

# transaction-type.deposit-сash.name
source: Deposit cash
ru: Пополнение наличными

# transaction-type.transfer-сash.name
source: Сash withdrawal
ru: Выдача наличных

# transaction-list.empty.title
source: It's empty here for now
ru: Здесь пока пусто

# transaction-list.empty.subtitle
source: All new transactions in this currency will be reflected here
ru: Все новые транзакции в этой валюте будут отражены здесь

# history-type.all.title
source: All history
ru: Вся история

# history-type.transfer.title
source: Transfers
ru: Переводы

# history-type.deposit.title
source: Deposits
ru: Пополнения

# history-type.conversion.title
source: Conversion
ru: Конвертация

# dx-dialog.title.password-changed
source: Password successfully changed
ru: Пароль успешно изменён

# dx-dialog.title.delete-account-confirmation
source: Are you sure you want to delete your account?
ru: Вы уверены, что хотите удалить аккаунт?

# dx-dialog.title.access-denied
source: Access denied
ru: Доступ не разрешён

# dx-dialog.title.login-confirmation
source: Confirm login
ru: Подтвердите вход

# dx-dialog.title.successful-transfer
source: Successful transfer
ru: Успешный перевод

# dx-dialog.title.insufficient-funds
source: Insufficient funds for currency exchange
ru: У вас недостаточно средств для обмена в этой валюте

# dx-dialog.title.successful-exchange
source: Successful exchange
ru: Успешный обмен

# dx-dialog.title.successful-recharge
source: Successful recharge
ru: Успешное пополнение

# dx-dialog.title.block-card-confirmation
source: Are you sure you want to block the card?
ru: Вы действительно хотите заблокировать карту?

# dx-dialog.title.card-deleted
source: Card deleted
ru: Карта удалена

# dx-dialog.title.pin-changed
source: PIN successfully changed
ru: ПИН-код успешно изменён

# dx-dialog.title.photo-access
source: Allow photo access
ru: Разрешите доступ к фото

# dx-dialog.title.email-changed
source: Your email address has been changed
ru: Ваш адрес электронной почты изменён

# dx-dialog.title.delete-card-confirmation
source: Are you sure you want to delete the card?
ru: Вы действительно хотите удалить карту?

# dx-dialog.title.logout-confirmation
source: Are you sure you want to logout?
ru: Вы действительно хотите выйти?

# dx-dialog.title.code-changed
source: Code changed
ru: Код изменён

# dx-dialog.title.code-saved
source: Code saved
ru: Код сохранен

# dx-dialog.title.phone-number-changed
source: Your phone number has been changed
ru: Ваш номер телефона изменён

# dx-dialog.button-title.cancel
source: Cancel
ru: Отменить

# dx-dialog.button-title.delete
source: Delete
ru: Удалить

# dx-dialog.button-title.back
source: Back
ru: Назад

# dx-dialog.button-title.confirm
source: Confirm
ru: Подтвердить

# dx-dialog.button-title.decline
source: Decline
ru: Отклонить

# dx-dialog.button-title.get-receipt
source: Get receipt
ru: Получить чек

# dx-dialog.button-title.to-main
source: To main
ru: На главную

# dx-dialog.button-title.exit
source: Exit
ru: Выход

# dx-dialog.button-title.block
source: Block
ru: Заблокировать

# dx-dialog.button-title.allow
source: Allow
ru: Разрешить

# dx-dialog.button-title.continue
source: Continue
ru: Продолжить

# wallet-requisites.empty-message
source: The details for the deposit are not available
ru: Реквизиты для пополнений недоступны

# wallet-requisites.fiat.sepa.title
source: Sepa requisites
ru: Реквизиты Sepa

# wallet-requisites.fiat.swift.title
source: Swift requisites
ru: Реквизиты Swift

# wallet-requisites.fiat.max-sum-title
source: Maximum amount
ru: Максимальная сумма

# wallet-requisites.fiat.min-sum-title
source: Minimum amount
ru: Минимальная сумма

# wallet-requisites.fiat.fee-title
source: Fee
ru: Комиссия

# wallet-requisites.fiat.beneficiary-title
source: Beneficiary name
ru: Наименование получателя

# wallet-requisites.fiat.comment-title
source: Comment
ru: Комментарий

# wallet-requisites.crypto.network-title
source: Network
ru: Сеть

# wallet-requisites.crypto.wallet-address-title
source: Wallet address
ru: Адрес кошелька

# network-selection.title
source: Select network
ru: Выберите сеть

# network-selection.block-approves
source: Block confirmations
ru: Подтверждений блоков

# network-selection.arrive-time
source: Arrival time %@ min
ru: Время поступления %@ мин

# network-selection.input-min-sum
source: Minimum input amount %@
ru: Минимальная сумма ввода %@

# payment.deposit.iban.title
source: Issue an invoice
ru: Выставить инвойс

# payment.deposit.card.title
source: Replenishment with a card
ru: Пополнение с помощью карты

# payment.deposit.crypto.title
source: Replenishment at the wallet address
ru: Пополнение по адресу кошелька

# payment.deposit.cash.title
source: Cash replenishment
ru: Пополнение наличными

# payment.transfer.iban.title
source: Transfer by IBAN
ru: Перевести по IBAN

# payment.transfer.card.title
source: Transfer to card
ru: Перевод на карту

# payment.transfer.crypto.title
source: Transfer crypto
ru: Перевод криптовалюты

# payment.transfer.cash.title
source: Cash withdrawal
ru: Выдача наличных

# transaction-info.date-and-time.title
source: Date and time
ru: Дата и время

# transaction-info.order-number.title
source: Order number
ru: Номер заказа

# transaction-info.exchange-number.title
source: Exchange number
ru: Номер обмена

# transaction-info.recipient.title
source: Recipient
ru: Кому

# transaction-info.recipient-name.title
source: Recipient name
ru: Имя получателя

# transaction-info.to-card.title
source: To card
ru: На карту

# transaction-info.wallet.title
source: Wallet
ru: Кошелек

# transaction-info.sender-id.title
source: Sender ID
ru: ID отправителя

# transaction-info.country.title
source: Country
ru: Страна

# transaction-info.transaction.title
source: Transaction
ru: Транзакция

# transaction-info.recipient-iban.title
source: Recipient IBAN
ru: IBAN получателя

# transaction-info.wallet-number.title
source: Wallet number
ru: Номер кошелька

# transaction-info.currency.title
source: Currency
ru: Валюта

# transaction-info.commission.title
source: Fee
ru: Комиссия

# transaction-info.transaction-txt-id.title
source: Transaction TxtId
ru: TxtId транзакции

# transaction-info.status.title
source: Status
ru: Статус

# transaction-info.direction.title
source: Direction
ru: Направление

# transaction-info.withdrawal-amount.title
source: Withdrawal amount
ru: Сумма списания

# transaction-info.deposit-amount.title
source: Deposit amount
ru: Сумма пополнения

# transaction-info.dpay-sender-user-email.title
source: Sender
ru: Отправитель

# transaction-info.dpay-recipient-user-email.title
source: Recipient
ru: Получатель

# transaction-info.address.title
source: Address
ru: Адрес

# transaction-check.deposit-card.navigation-title
source: Card deposit
ru: Пополнение карты

# transaction-check.transfer-crypto.navigation-title
source: Crypto transfer
ru: Перевод криптовалюты

# transaction-check.transfer-iban.navigation-title
source: SEPA transfer
ru: Перевод SEPA

# transaction-check.payment-card.navigation-title
source: Card payment
ru: Перевод на карту

# transaction-check.transfer-card.navigation-title
source: Transfer to card
ru: Перевод на карту

# transaction-check.conversion.navigation-title
source: Conversion
ru: Конвертация

# transaction-check.fee.navigation-title
source: Transaction fee
ru: Комиссия по транзакции

# transaction-check.deposit-crypto.navigation-title
source: Crypto deposit
ru: Пополненение криптовалюты

# transaction-check.deposit-pay.navigation-title
source: GDEBank deposit
ru: Пополнение GDEBank

# transaction-check.transfer-pay.navigation-title
source: GDEBank transfer
ru: Перевод GDEBank

# transaction-check.deposit-iban.navigation-title
source: SEPA deposit
ru: Пополнение SEPA

# transaction-check.deposit-cash.navigation-title
source: Deposit cash
ru: Пополнение наличными

# transaction-check.transfer-cash.navigation-title
source: Сash withdrawal
ru: Выдача наличных

# transaction-check.cheque.navigation-title
source: The release of Manager Cheque
ru: Выпуск Manager Cheque
