Repository: Gleb-Kovalenko/GDEBankProject
Catalog: GDEBankCore/Resources/Localization/*.lproj/GDEBankCoreLocalizable.strings
Languages: ru

# qr-code.title
source: Scan QR-code
ru: Сканировать QR-код

# qr-code.instruction
source: Place the QR code in the frame for scanning
ru: Поместите QR-код в рамку для сканирования

# qr-scanning.error.no-video-device
source: No video device found
ru: Устройство для записи видео не найдено

# qr-scanning.error.add-video-input
source: Failed to add video input
ru: Не удалось добавить видеоввод

# qr-scanning.error.add-metadata-output
source: Failed to add metadata output
ru: Не удалось добавить выход метаданных

# qr-scanning.error.torch-unavailable
source: Torch is not available on this device
ru: Фонарик недоступен на этом устройстве

# qr-scanning.error.toggle-flash
source: Failed to toggle the flash
ru: Не удалось включить/выключить фонарик

# qr-scanning.error.no-qr-code
source: No QR code detected
ru: QR-код не найден

# qr-scanning.error.unable-to-process-code
source: Unable to process the detected code
ru: Не удалось обработать код

# qr-scanning.error.empty-qr-code
source: The QR code is empty
ru: QR-код пуст

# qr-scanning.error.failed-image-selection
source: Failed to retrieve the selected image
ru: Не удалось получить выбранное изображение

# qr-scanning.error.failed-image-processing
source: Failed to process the image for QR code detection
ru: Не удалось обработать изображение для сканирования QR-кода

# qr-scanning.error.no-qr-code-in-image
source: No QR code found in the selected image
ru: QR-код не найден в выбранном изображении

# cash-operations.badge.cash
source: Cash
ru: Наличные

# cash-operations.country
source: Country
ru: Страна

# cash-operations.office
source: Branch/office
ru: Отделение/офис

# cash-operations.transfer.complete-message
source: Your code for receiving cash
ru: Ваш код для получения наличных

# cash-operations.transfer.complete-message-subtitle
source: For more information, contact the support center
ru: Для дополнительной информации свяжитесь с центром поддержки

# cash-operations.deposit.complete-message
source: Your code for receiving cash
ru: Ваш код для получения наличных

# cash-operations.deposit.complete-message-subtitle
source: For more information, contact the support center
ru: Для дополнительной информации свяжитесь с центром поддержки

# cash-operations.cheque.complete-message
source: Contact the support center to receive the order
ru: Свяжитесь с центром поддержки для получения заказа

# cash-operations.transfer.button-title
source: Continue
ru: Продолжить

# cash-operations.cheque.button-title
source: Continue
ru: Продолжить

# cash-operations.deposit.button-title
source: Issue
ru: Выдать
